#include<stdio.h>
int f(int x){
    int fac=1; //ให้มีค่า = 1 เพราะ แฟกเริ่มที่ 1 
    if(x==1){ //กรณีที่ค่าที่รับมาเป็น 1  
        printf("1"); //แสดงผลเป็น 1
        return fac; //ส่งค่า fac คือ 1 กลับไปแสดงผล
    }
    else if(x<=0){ //กรณีที่ fac <=0 ค่าก็จะเป็น 0 เสมอ เพราะ -2 -1 0 มันไม่มีในสูตร เพราะมันเริ่มที่ 1
        printf("0"); //แสดงผล 0 
        return 0; // ส่งค่า 0 กลับไปเป็นผลรวม 
    }
    else{ //กรณีที่ ถูกทั้งหมด
        printf("%dX",x); //แสดงผลแบบ 5X4X3X2X ถ้ามันถึง 1 มันจะเข้ากรณีแรก จะแสดงแค่ 1 จะไม่แสดง X ตามหลัง 
        fac = x*f(x-1); // ตายตัวเลย เอาทุกตัวมาคูณ เข้าด้วยกันแล้วรวมใน fac 
        return fac; //ส่งค่าผมคูณทั้งหมดไปแสดงเป็นผลรวม
    }
}

int main(){
    int x; //ประกาศตัวแปร
    printf("Enter num : ");
    scanf("%d",&x); //รับค่า มา
    printf("%d! = ",x); //โชว์ค่าที่รับมาใส่ ..! เพื่อให้เหมือนจาน 
    printf(" = %d",f(x)); //แสดงผลรวมพร้อมทั้งแอบส่งค่าไปด้วยแบบฟังก์ชั่น จะได้ไม่เขียนหลายบรรทัด
 return 0; 
}
